Rhino.Inside.Revit API
Revit Class
 Provides a set of static (Shared in Visual Basic) methods for accessing Revit API from Rhino.Inside.
Inheritance Hierarchy
System.Object
 RhinoInside.Revit.Revit
 Namespace: RhinoInside.Revit
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.7.8130
Syntax
public static class Revit
class Revit
The Revit type exposes the following members.
Properties
Name | Description
ActiveDBApplication
 Gets the active Autodesk.Revit.ApplicationServices.Application in the current DB session.
ActiveDBDocument
 Gets the active Autodesk.Revit.DB.Document in the Revit UI.
ActiveUIApplication
 Gets the active Autodesk.Revit.UI.UIApplication in the current UI session.
ActiveUIDocument
 Gets the active Autodesk.Revit.UI.UIDocument in the Revit UI.
Top
See Also
Reference
RhinoInside.Revit Namespace